In [ ]:
import pandas as pd
import numpy as np

#### Handling missing data in pandas

In [ ]:
pd.isnull(np.nan)

In [ ]:
pd.isnull(None)

In [ ]:
pd.isna(np.nan)

In [ ]:
pd.isna(None)

In [ ]:
pd.notnull(np.nan)

In [ ]:
pd.notna(None)

#### Checking missing Data from pd Series and DataFrame

In [ ]:
pd.isnull(pd.Series([1, np.nan, 7]))

In [ ]:
s = pd.Series([1, np.nan, 3, np.nan, np.nan, 6, 7])

In [ ]:
pd.notnull(s).sum()

In [ ]:
pd.isnull(s).sum()

In [ ]:
s[pd.notnull(s)]

In [ ]:
s[s.notnull()]

In [ ]:
# this drops all the rows with null values on them
s.dropna()

In [ ]:
law = pd.DataFrame({
    "Column A": [1, 2, 3, np.nan], 
    "Column B": [np.nan, 2, np.nan, 4],
    "Column E": [1, 2, 3, np.nan], 
    "Column C": [1, 2, 3, 4], 
    "Column D": [np.nan, 2, 3, np.nan]
})

In [ ]:
law

In [ ]:
pd.notnull(law).count()

In [ ]:
pd.notnull(law).sum()

In [ ]:
pd.isnull(law).sum()

In [ ]:
law.isnull()

In [ ]:
law.notnull()

In [ ]:
law[pd.notnull(law)]

In [ ]:
law[law.notnull()]

In [ ]:
# this drops all the rows with null values on them
law.dropna()

In [ ]:
law.dropna(axis = 1)

In [ ]:
# this drops all the rows with null values on them
law.dropna(how = "any")

In [ ]:
law.dropna(how = "any", axis = "columns")

In [ ]:
# this will drop the rows with their vlaues intact
law.dropna(how = "all")

In [ ]:
law.dropna(how = "all", axis = "columns")

In [ ]:
# thresh sets a threshold
law.dropna(thresh = 3)

In [ ]:
law.dropna(thresh = 3, axis = "columns")

#### Filling null values

In [ ]:
law

In [ ]:
law.fillna(0)

In [ ]:
law.fillna({"Column A": 1, "Column B": 2, "Column C": 3, "Column D": 4, "Column E":5})

In [ ]:
law.fillna(method = "ffill")

In [ ]:
law.fillna(method = "bfill")

In [ ]:
s

In [ ]:
s.fillna(0)

In [ ]:
s.fillna(method = "ffill")

In [ ]:
s.fillna(method = "bfill")

#### Cleaning Not Null Values

In [ ]:
ar = pd.DataFrame({
    "Sex": ["M", "B", "M", "F", "M"],
    "Age": [22, 55, 17, 35, 333]
})
ar

In [ ]:
ar[ar["Age"] > 100]

#### Duplicates

In [36]:
pa = pd.Series([
    "Ghana",
    "Russia",
    "Russia",
    "United State",
    "United Kindom",
    "Nigeria",
    "Nigeria",
    "Nigeria"
], index = [
    "Mahama",
    "Putin",
    "Mrman",
    "Trump",
    "Queen",
    "Tinbu",
    "Guy",
    "Man"
])
pa

Mahama            Ghana
Putin            Russia
Mrman            Russia
Trump      United State
Queen     United Kindom
Tinbu           Nigeria
Guy             Nigeria
Man             Nigeria
dtype: object

In [ ]:
pa.duplicated()

In [ ]:
pa.duplicated( keep = "last")

In [ ]:
pa.duplicated( keep = False)

In [ ]:
pa.drop_duplicates()

In [ ]:
pa.drop_duplicates( keep = "last")

In [ ]:
pa.drop_duplicates( keep = False)

In [51]:
ja = pd.DataFrame({
    "schools": [ 
        "GCTU",
        "UG",
        "UG",
        "UDS",
        "KNUST",
        "GCTU",
        "UCC",
        "UCC",
    ],     
    "region": [
        "Accra",
        "Accra",
        "idustrial",
        "Bolga",
        "Asanti",
        "Tesano",
        "Cape Coast",
        "Elmina"
    ]
})
ja

  schools      region
0    GCTU       Accra
1      UG       Accra
2      UG   idustrial
3     UDS       Bolga
4   KNUST      Asanti
5    GCTU      Tesano
6     UCC  Cape Coast
7     UCC      Elmina

In [52]:
ja.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
dtype: bool

In [53]:
ja.duplicated( subset = ["schools"])

0    False
1    False
2     True
3    False
4    False
5     True
6    False
7     True
dtype: bool

In [54]:
ja.duplicated( subset = ["schools"], keep = "last")

0     True
1     True
2    False
3    False
4    False
5    False
6     True
7    False
dtype: bool

In [55]:
ja.drop_duplicates()

  schools      region
0    GCTU       Accra
1      UG       Accra
2      UG   idustrial
3     UDS       Bolga
4   KNUST      Asanti
5    GCTU      Tesano
6     UCC  Cape Coast
7     UCC      Elmina

In [57]:
ja.drop_duplicates( subset = ["schools"])

  schools      region
0    GCTU       Accra
1      UG       Accra
3     UDS       Bolga
4   KNUST      Asanti
6     UCC  Cape Coast

In [56]:
ja.drop_duplicates( subset = ["schools"], keep = "last")

  schools     region
2      UG  idustrial
3     UDS      Bolga
4   KNUST     Asanti
5    GCTU     Tesano
7     UCC     Elmina

In [121]:
aa = pd.DataFrame({
    "Data": [ 
        "1974_M_CA_1",
        "1979_F_AU_2",
        "1995?_M_US_1",
        "1997_F_UK_2",
        "2000?_F_US_3",
        "2005_F_CA_4",
        "2007?_M_US_5",
        "2019_M_AU_1",
]})
aa

           Data
0   1974_M_CA_1
1   1979_F_AU_2
2  1995?_M_US_1
3   1997_F_UK_2
4  2000?_F_US_3
5   2005_F_CA_4
6  2007?_M_US_5
7   2019_M_AU_1

In [92]:
aa.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Data    8 non-null      object
dtypes: object(1)
memory usage: 196.0+ bytes

In [101]:
aa["Data"].str.split("_")

0     [1974, M, CA, 1]
1     [1979, F, AU, 2]
2    [1995?, M, US, 1]
3     [1997, F, UK, 2]
4    [2000?, F, US, 3]
5     [2005, F, CA, 4]
6    [2007?, M, US, 5]
7     [2019, M, AU, 1]
Name: Data, dtype: object

In [122]:
aa["Data"].str.split("_", expand = True)

       0  1   2  3
0   1974  M  CA  1
1   1979  F  AU  2
2  1995?  M  US  1
3   1997  F  UK  2
4  2000?  F  US  3
5   2005  F  CA  4
6  2007?  M  US  5
7   2019  M  AU  1

In [123]:
aa = aa["Data"].str.split("_", expand = True)

In [124]:
aa.columns = ["Year", "Sex", "Country", "Position"]

In [125]:
aa

    Year Sex Country Position
0   1974   M      CA        1
1   1979   F      AU        2
2  1995?   M      US        1
3   1997   F      UK        2
4  2000?   F      US        3
5   2005   F      CA        4
6  2007?   M      US        5
7   2019   M      AU        1

In [126]:
aa["Year"].str.contains("\?")

<>:1: SyntaxWarning: invalid escape sequence '\?'
<>:1: SyntaxWarning: invalid escape sequence '\?'
C:\Users\USER\AppData\Local\Temp\ipykernel_16312\1235852578.py:1: SyntaxWarning: invalid escape sequence '\?'
  aa["Year"].str.contains("\?")

0    False
1    False
2     True
3    False
4     True
5    False
6     True
7    False
Name: Year, dtype: bool

In [127]:
aa["Country"].str.contains("U")

0    False
1     True
2     True
3     True
4     True
5    False
6     True
7     True
Name: Country, dtype: bool

In [128]:
aa["Country"].str.strip()

0    CA
1    AU
2    US
3    UK
4    US
5    CA
6    US
7    AU
Name: Country, dtype: object

In [129]:
aa["Country"].str.replace(" ", " ")

0    CA
1    AU
2    US
3    UK
4    US
5    CA
6    US
7    AU
Name: Country, dtype: object